# ImageBackgroundSettings Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageBackgroundSettings Class
Members See Also
---
Represents the rendering image background settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class ImageBackgroundSettings : BackgroundSettings
```

Visual Basic
---
```text
Public Class ImageBackgroundSettings _
	Inherits BackgroundSettings
```

Visual C++
---
```text
public ref class ImageBackgroundSettings : public BackgroundSettings
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BackgroundSettings Autodesk.Revit.DB..::..ImageBackgroundSettings
# See Also
ImageBackgroundSettings Members
Autodesk.Revit.DB Namespace